###################################################################

# Created by write_sdc on Mon Oct 21 11:56:07 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[11]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[10]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[9]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[8]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[7]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[6]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[5]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[4]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[3]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[2]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[1]}]
set_load -pin_load 57.462 [get_ports {if_icache_req_addr[0]}]
set_load -pin_load 57.462 [get_ports if_icache_req_valid]
set_load -pin_load 57.462 [get_ports if_icache_req_rw]
set_load -pin_load 57.462 [get_ports cpu_jump]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[11]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[10]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[9]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[8]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[7]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[6]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[5]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[4]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[3]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[2]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[1]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_req_addr[0]}]
set_load -pin_load 57.462 [get_ports mem_dcache_req_valid]
set_load -pin_load 57.462 [get_ports mem_dcache_req_rw]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[63]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[62]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[61]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[60]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[59]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[58]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[57]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[56]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[55]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[54]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[53]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[52]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[51]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[50]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[49]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[48]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[47]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[46]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[45]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[44]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[43]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[42]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[41]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[40]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[39]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[38]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[37]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[36]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[35]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[34]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[33]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[32]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[31]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[30]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[29]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[28]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[27]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[26]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[25]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[24]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[23]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[22]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[21]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[20]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[19]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[18]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[17]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[16]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[15]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[14]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[13]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[12]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[11]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[10]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[9]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[8]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[7]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[6]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[5]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[4]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[3]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[2]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[1]}]
set_load -pin_load 57.462 [get_ports {mem_dcache_data_write[0]}]
create_clock [get_ports clk]  -period 50000  -waveform {0 25000}
